In [1]:
import warnings
warnings.filterwarnings("ignore")
import pandas as pd
import a_funciones as fn
import datetime
# import

In [2]:
in_time = 'data\in_time.csv'
out_time = 'data\out_time.csv'

#Se procesa los dataframe con pandas y se almacenan
d_time_in = pd.read_csv(in_time)
d_time_out = pd.read_csv(out_time)

In [3]:
d_time_in.head()
d_time_in.rename(columns={'Unnamed: 0':'EmployeeID'}, inplace=True)
d_time_in.head()

,EmployeeID,2015-01-01,2015-01-02,2015-01-05,2015-01-06,2015-01-07,2015-01-08,2015-01-09,2015-01-12,2015-01-13,...,2015-12-18,2015-12-21,2015-12-22,2015-12-23,2015-12-24,2015-12-25,2015-12-28,2015-12-29,2015-12-30,2015-12-31
0,1,NaN,2015-01-02 09:43:45,2015-01-05 10:08:48,2015-01-06 09:54:26,2015-01-07 09:34:31,2015-01-08 09:51:09,2015-01-09 10:09:25,2015-01-12 09:42:53,2015-01-13 10:13:06,...,NaN,2015-12-21 09:55:29,2015-12-22 10:04:06,2015-12-23 10:14:27,2015-12-24 10:11:35,NaN,2015-12-28 10:13:41,2015-12-29 10:03:36,2015-12-30 09:54:12,2015-12-31 10:12:44
1,2,NaN,2015-01-02 10:15:44,2015-01-05 10:21:05,NaN,2015-01-07 09:45:17,2015-01-08 10:09:04,2015-01-09 09:43:26,2015-01-12 10:00:07,2015-01-13 10:43:29,...,2015-12-18 10:37:17,2015-12-21 09:49:02,2015-12-22 10:33:51,2015-12-23 10:12:10,NaN,NaN,2015-12-28 09:31:45,2015-12-29 09:55:49,2015-12-30 10:32:25,2015-12-31 09:27:20
2,3,NaN,2015-01-02 10:17:41,2015-01-05 09:50:50,2015-01-06 10:14:13,2015-01-07 09:47:27,2015-01-08 10:03:40,2015-01-09 10:05:49,2015-01-12 10:03:47,2015-01-13 10:21:26,...,2015-12-18 10:15:14,2015-12-21 10:10:28,2015-12-22 09:44:44,2015-12-23 10:15:54,2015-12-24 10:07:26,NaN,2015-12-28 09:42:05,2015-12-29 09:43:36,2015-12-30 09:34:05,2015-12-31 10:28:39
3,4,NaN,2015-01-02 10:05:06,2015-01-05 09:56:32,2015-01-06 10:11:07,2015-01-07 09:37:30,2015-01-08 10:02:08,2015-01-09 10:08:12,2015-01-12 10:13:42,2015-01-13 09:53:22,...,2015-12-18 10:17:38,2015-12-21 09:58:21,2015-12-22 10:04:25,2015-12-23 10:11:46,2015-12-24 09:43:15,NaN,2015-12-28 09:52:44,2015-12-29 09:33:16,2015-12-30 10:18:12,2015-12-31 10:01:15
4,5,NaN,2015-01-02 10:28:17,2015-01-05 09:49:58,2015-01-06 09:45:28,2015-01-07 09:49:37,2015-01-08 10:19:44,2015-01-09 10:00:50,2015-01-12 10:29:27,2015-01-13 09:59:32,...,2015-12-18 09:58:35,2015-12-21 10:03:41,2015-12-22 10:10:30,2015-12-23 10:13:36,2015-12-24 09:44:24,NaN,2015-12-28 10:05:15,2015-12-29 10:30:53,2015-12-30 09:18:21,2015-12-31 09:41:09

In [4]:
# d_time_out.head()
d_time_out.rename(columns={'Unnamed: 0':'EmployeeID'}, inplace=True)
d_time_out.head()

,EmployeeID,2015-01-01,2015-01-02,2015-01-05,2015-01-06,2015-01-07,2015-01-08,2015-01-09,2015-01-12,2015-01-13,...,2015-12-18,2015-12-21,2015-12-22,2015-12-23,2015-12-24,2015-12-25,2015-12-28,2015-12-29,2015-12-30,2015-12-31
0,1,NaN,2015-01-02 16:56:15,2015-01-05 17:20:11,2015-01-06 17:19:05,2015-01-07 16:34:55,2015-01-08 17:08:32,2015-01-09 17:38:29,2015-01-12 16:58:39,2015-01-13 18:02:58,...,NaN,2015-12-21 17:15:50,2015-12-22 17:27:51,2015-12-23 16:44:44,2015-12-24 17:47:22,NaN,2015-12-28 18:00:07,2015-12-29 17:22:30,2015-12-30 17:40:56,2015-12-31 17:17:33
1,2,NaN,2015-01-02 18:22:17,2015-01-05 17:48:22,NaN,2015-01-07 17:09:06,2015-01-08 17:34:04,2015-01-09 16:52:29,2015-01-12 17:36:48,2015-01-13 18:00:13,...,2015-12-18 18:31:28,2015-12-21 17:34:16,2015-12-22 18:16:35,2015-12-23 17:38:18,NaN,NaN,2015-12-28 17:08:38,2015-12-29 17:54:46,2015-12-30 18:31:35,2015-12-31 17:40:58
2,3,NaN,2015-01-02 16:59:14,2015-01-05 17:06:46,2015-01-06 16:38:32,2015-01-07 16:33:21,2015-01-08 17:24:22,2015-01-09 16:57:30,2015-01-12 17:28:54,2015-01-13 17:21:25,...,2015-12-18 17:02:23,2015-12-21 17:20:17,2015-12-22 16:32:50,2015-12-23 16:59:43,2015-12-24 16:58:25,NaN,2015-12-28 16:43:31,2015-12-29 17:09:56,2015-12-30 17:06:25,2015-12-31 17:15:50
3,4,NaN,2015-01-02 17:25:24,2015-01-05 17:14:03,2015-01-06 17:07:42,2015-01-07 16:32:40,2015-01-08 16:53:11,2015-01-09 17:19:47,2015-01-12 17:13:37,2015-01-13 17:11:45,...,2015-12-18 17:55:23,2015-12-21 16:49:09,2015-12-22 17:24:00,2015-12-23 17:36:35,2015-12-24 16:48:21,NaN,2015-12-28 17:19:34,2015-12-29 16:58:16,2015-12-30 17:40:11,2015-12-31 17:09:14
4,5,NaN,2015-01-02 18:31:37,2015-01-05 17:49:15,2015-01-06 17:26:25,2015-01-07 17:37:59,2015-01-08 17:59:28,2015-01-09 17:44:08,2015-01-12 18:51:21,2015-01-13 18:14:58,...,2015-12-18 17:52:48,2015-12-21 17:43:35,2015-12-22 18:07:57,2015-12-23 18:00:49,2015-12-24 17:59:22,NaN,2015-12-28 17:44:59,2015-12-29 18:47:00,2015-12-30 17:15:33,2015-12-31 17:42:14

In [5]:
d_time_in.isnull().sum()

EmployeeID       0
2015-01-01    4410
2015-01-02     209
2015-01-05     206
2015-01-06     228
              ...
2015-12-25    4410
2015-12-28     234
2015-12-29     230
2015-12-30     265
2015-12-31     213
Length: 262, dtype: int64

In [6]:
d_time_out.isnull().sum()

EmployeeID       0
2015-01-01    4410
2015-01-02     209
2015-01-05     206
2015-01-06     228
              ...
2015-12-25    4410
2015-12-28     234
2015-12-29     230
2015-12-30     265
2015-12-31     213
Length: 262, dtype: int64

In [7]:
for i in d_time_out.columns[1:]:
    d_time_in[i] = pd.to_datetime(d_time_in[i], format='%Y-%m-%d %H:%M:%S')
    d_time_out[i] = pd.to_datetime(d_time_out[i], format='%Y-%m-%d %H:%M:%S')

In [8]:
d_time_full = []
d_time_full = pd.DataFrame(d_time_full)
for i in d_time_out.columns[1:]:
    duracion = d_time_out[i].dt.hour - d_time_in[i].dt.hour
    d_time_full[i] = duracion

In [9]:
d_time_full.head()

,2015-01-01,2015-01-02,2015-01-05,2015-01-06,2015-01-07,2015-01-08,2015-01-09,2015-01-12,2015-01-13,2015-01-14,...,2015-12-18,2015-12-21,2015-12-22,2015-12-23,2015-12-24,2015-12-25,2015-12-28,2015-12-29,2015-12-30,2015-12-31
0,NaN,7.0,7.0,8.0,7.0,8.0,7.0,7.0,8.0,NaN,...,NaN,8.0,7.0,6.0,7.0,NaN,8.0,7.0,8.0,7.0
1,NaN,8.0,7.0,NaN,8.0,7.0,7.0,7.0,8.0,NaN,...,8.0,8.0,8.0,7.0,NaN,NaN,8.0,8.0,8.0,8.0
2,NaN,6.0,8.0,6.0,7.0,7.0,6.0,7.0,7.0,NaN,...,7.0,7.0,7.0,6.0,6.0,NaN,7.0,8.0,8.0,7.0
3,NaN,7.0,8.0,7.0,7.0,6.0,7.0,7.0,8.0,NaN,...,7.0,7.0,7.0,7.0,7.0,NaN,8.0,7.0,7.0,7.0
4,NaN,8.0,8.0,8.0,8.0,7.0,7.0,8.0,9.0,NaN,...,8.0,7.0,8.0,8.0,8.0,NaN,7.0,8.0,8.0,8.0

In [10]:
d_time_mean = pd.DataFrame()
# d_time_full.mean(axis=1)
d_time_mean["EmployeeID"] = d_time_in["EmployeeID"]
d_time_mean["mean_time"] = d_time_full.mean(axis=1)

In [11]:
d_time_mean.head()

   EmployeeID  mean_time
0           1   7.409483
1           2   7.745763
2           3   6.983471
3           4   7.217021
4           5   8.044898

In [16]:
d_time_mean['mean_time'] = d_time_mean['mean_time'].round(0)

In [20]:
d_time_mean['mean_time'] = d_time_mean['mean_time'].astype(int)

In [21]:
d_time_mean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4410 entries, 0 to 4409
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmployeeID  4410 non-null   int64
 1   mean_time   4410 non-null   int32
dtypes: int32(1), int64(1)
memory usage: 51.8 KB

In [22]:
#Descarga de datos para el anÃ¡lisis exploratorio
# d_time_mean.to_csv("data_mean.csv", index = False)